projects = {
    "Project-01": {
        "name": "احداث تقاطع غیر همسطح ورودی و پل دو دهانه بتنی بر روی دره زنجیر پردیس ۲۵۰ هکتاری مجتمع تفریحی، فرهنگی و توریستی کوثر یزد (کاریزبوم)",
        "location": "یزد",
        "contract_number": "124012300",
        "start_date": "2022-08-14",
        "end_date": "2024-10-07",
        "budget": 761693497874.0,
        "Owner": "کوثر",
        "manager": "دکتر امیری"
    },
    "Project-02": {
        "name": "پروژه احداث باند دوم جاده از مجتمع معدنی چادرملو تا گندله سازی بهاباد",
        "location": "بهاباد",
        "contract_number": "1403/493/ح",
        "start_date": "2025-04-05",
        "end_date": "2028-04-06",
        "budget": 8950000000000.0,
        "Owner": "شرکت معدنی و صنعتی چادرملو",
        "manager": "دکتر امیری"
    },
}