projects = {
    "Project-01": {
        "name": "اجرای سد باطله (تیلینگ) معدن چادرملو",
        "location": "یزد - بافق",
        "contract_number": "440/1403/ح",
        "start_date": "1403-05-01",
        "end_date": "On-Going",
        "budget": 5000000.0,
        "Owner": "شرکت معدنی و صنعتی چادرملو",
        "manager": "Amiri"
    },
    "Project-02": {
        "name": "احداث باند دوم جاده از مجتمع معدنی چادرملو به گندله سازی بهاباد",
        "location": "چادرملو",
        "contract_number": "شرکت معدنی و صنعتی چادرملو",
        "start_date": "2025-09-23",
        "end_date": "On-Going",
        "budget": 10.0,
        "Owner": "شرکت معدنی و صنعتی چادرملو",
        "manager": "دکتر امیری"
    },
    "Project-04": {
        "name": "احداث تقاطع غیر همسطح ورودی و پل دو دهانه بتنی بر روی دره زنجیر پردیس ۲۵۰ هکتاری مجتمع تفریحی، فرهنگی و توریستی کوثر یزد (کاریزبوم)",
        "location": "یزد",
        "contract_number": "124012300",
        "start_date": "2022-08-14",
        "end_date": "2024-10-07",
        "budget": 761693497874.0,
        "Owner": "کوثر",
        "manager": "دکتر امیری"
    },
}