configuration = {
    "Date_And_Time": ["کد سند", "تاریخ", "روز هفته", "شیفت کاری"],
    "Human_Resources": ["مدیر پروژه", "سرپرست کارگاه", "مسئول اجرا", "مسئول HSE", "نقشه بردار", "کمک نقشه بردار", 
                        "کنترل پروژه", "حسابدار", "تدارکات", "کارگر ساده", "بنا", "بتن ریز", "انباردار", "نگهبان", 
                        "خدمات", "راننده ماشین سنگین", "راننده سواری و وانت", "برقکار", "سرویس کار", "مکانیک", "جوشکار"],
    "Tools_And_Equipments": ["بیل مکانیکی", "لودر", "کامیون کمپرسی ۱۰ چرخ", "کامیون کمپرسی تک", "کامیون آب پاش", "تانکر آب",
                             "تانکر گازوئیل", "گریدر", "غلتک", "تریلی", "وانت", "سواری", "دوربین نقشه برداری", "دوربین GPS", 
                             "بولدوزر(کارفرما)", "لودر(کارفرما)", "بیل مکانیکی(کارفرما)"],
    "Incoming_Materials_And_Goods": ["شن و ماسه", "قیر", "آسفالت", "بتن آماده", "آجر", "آهن آلات", "سیمان", "ماسه بادی", "ماسه شکسته",],
    "Climate_Condition": ["حداقل دمای هوا", "حداکثر دمای هوا", "رطوبت هوا", "صاف", "ابری", "بارانی", "مه‌آلود", "برفی"],
    "Daily_Activity_Report": ["خاکریزی", "پی‌ریزی", "آرماتوربندی", "قالب‌بندی", "بتن‌ریزی", "آسفالت‌ریزی", "سنگ‌کاری", "آجرچینی",],
    "Project_Issues": ["معضلات مردمی", "مشکلات تامین مصالح", "مشکلات نیروی انسانی", "مشکلات تجهیزاتی", "مسائل مالی", "مسائل فنی",],
    "Units": ["متر (m)", "متر مربع (m²)", "متر مکعب (m³)", "کیلومتر (km)", "کیلوگرم (kg)", "تن (ton)", "لیتر (L)"],
}